app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.paginate(page:params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
  def edit
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
  def update
    @user = User.find(params[:id])

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 980190962]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
  def destroy
    User.find(params[:id]).destroy